app/controllers/grupos_controller.rb

SELECT "grupos".* FROM "grupos"
---
  def index
    @grupos = Grupo.all

INSERT INTO "grupos" ("nome", "descricao", "faculdade", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Novo grupo"], ["descricao", "boa gente"], ["faculdade", "fct"], ["created_at", "2019-03-24 18:53:55.891367"], ["updated_at", "2019-03-24 18:53:55.891367"]]
---
  def create
    @grupo = Grupo.new(grupo_params)

    respond_to do |format|
      if @grupo.save

UPDATE "grupos" SET "nome" = $1, "updated_at" = $2 WHERE "grupos"."id" = $3  [["nome", "NEA2"], ["updated_at", "2019-03-24 18:20:45.280823"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @grupo.update(grupo_params)

DELETE FROM "grupos" WHERE "grupos"."id" = $1  [["id", 1]]
---
  def destroy
    @grupo.destroy

SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_grupo
      @grupo = Grupo.find(params[:id])